{
  "first_quest": {
    "blockers": [],
    "en_name": "My first quest",
    "fr_name": "Ma première quête",
    "type": "talk_to",
    "parameters": ["Chaiyaphum", "RandomMonk"],
    "en_description": "Go talk to the random monk.",
    "fr_description": "Va parler au moine derrière le temple.",
    "counter_max": 1
  },
  "find_sentences_in_chaiyaphum": {
    "blockers": [],
    "en_name": "Sentences in Chaiyaphum",
    "fr_name": "Les phrases de Chaiyaphum",
    "en_description": "Talk to everybody in Chaiyaphum and collect their sentences.",
    "fr_description": "Parle à tous les habitants de Chaiyaphum et collecte leurs phrases.",
    "en_counter_name": "Sentences found",
    "fr_counter_name": "Phrases trouvées ",
    "en_end_description": "Go back to Anchalee in Chaiyaphum's temple.",
    "fr_end_description": "Retourne voir Anchalee au temple de Chaiyaphum.",
    "en_finish_dialog": [
      "Congratulations, [Name], you've found all the sentences!"
    ],
    "fr_finish_dialog": [
      "Félicitations, [Name], tu as trouvé toutes les phrases."
    ],
    "en_start_dialog": [
      "Welcome back to Chaiyaphum, [Name].",
      "Your grandmother asked me to overlook your shamanic training for a bit.",
      "Your first task will be to talk to everybody in Chaiyaphum to gather sentences in Thai.",
      "Come back to me when you’ve found at least eleven sentences!"
    ],
    "fr_start_dialog": [
      "Il est bon de te revoir à Chaiyaphum, [Name].",
      "Ta grand-mère m'a demandé de m'occuper de ton éducation linguistique pendant quelques temps.",
      "Ta première tâche sera de parler à tout les gens qui habitent ici à Chaiyaphum, et collecter leurs phrases.",
      "Reviens me voir quand tu auras trouvé au moins onze phrases."
    ],
    "type": "find_sentences",
    "parameters": [[200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210], []]
  },
  "implant_source_behind_the_temple": {
    "blockers": ["find_sentences_in_chaiyaphum"],
    "en_name": "First source implant",
    "fr_name": "Première implémentation d'un Mot",
    "counter_max": 1,
    "en_start_dialog": [
      "Ok, [Name], let's carry on with your training.",
      "As you may know, Spells stem from sources.",
      "Our role as shaman is to make sure each Spell has a home, so that we never run out of Spells.",
      "It appears that the Spell อะไร has no more home, so we need to implant it into a source, otherwise it will disappear.",
      "Take this Spell, and go implant it in the sacred stone behind the temple."
    ],
    "fr_start_dialog": [
      "Ok, [Name], continuons ton éducation de chaman.",
      "Comme tu le sais peut-être déjà, les Mots proviennent de sources.",
      "Notre rôle en tant que chamans est de s'assurer que chaque Mot aie un foyer,",
      "pour qu'aucun ne soit perdu à jamais.",
      "Il se trouve que le Mot อะไร n'a plus de foyer, alors il faut l'implanter dans une source, sinon il va disparaitre.",
      "Prend ce mot, et va l'implanter dans la source sacrée derrière le temple."
    ],
    "en_description": "Implant the Spell อะไร in the source of the sacred stone behind Chaiyaphum's temple.",
    "fr_description": "Implante le Mot อะไร dans la source de la pierre sacréee derrière le temple du Chaiyaphum.",
    "en_end_description": "Go back to Anchalee in Chaiyaphum's temple.",
    "fr_end_description": "Retourne voir Anchalee au temple de Chaiyaphum.",
    "fr_finish_dialog": [
      "Excellent, maintenant tu sais implanter un mot dans une source.",
      "C'est très utile, ça te permet de garder au près de toi les mots que tu veux,",
      "ça t'aide à te rappeler des mots si tu sais où les trouver,",
      "et ça nous permet de restaurer l'équilibre, car de plus en plus de mots disparaissent."
    ],
    "en_finish_dialog": [
      "Excellent, [Name], now you know how to implant a Spell in a source.",
      "That's very useful, it allows you to keep with you the words you need,",
      "and knowing where a Spell lives helps you remember it.",
      "Besides, it's our role to restore balance, as more and more Spells are going missing lately."
    ],
    "type": "implant_source_with_this_word_i_gave_you",
    "parameters": [56, "EmptySourceBehindWat"]
  },
  "implant_source_in_chaiyaphum_field": {
    "blockers": ["implant_source_behind_the_temple"],
    "en_name": "Looking for water",
    "fr_name": "Chercher de l'eau",
    "counter_max": 1,
    "en_start_dialog": [
      "Excuse me, but I noticed you are a shaman apprentice - would you help me?",
      "In my field, there used to be a source for the Spell of water: น้ำ.",
      "But for some reason it got dried up this morning, and all the Spells are gone.",
      "They were doing all the watering for my crops, so I'd be super grateful if you could implant water in it again!",
      "I hear there's a well south from here where you could find water Spells,",
      "would you like to fetch one and implant it into my well?"
    ],
    "fr_start_dialog": [
      "Excusez-moi, mais j'ai remarqué que vous faisiez un apprentissage de chaman - pourriez-vous m'aider ?",
      "Dans mon champs, avant il y avait une source pour le mot de l'eau: น้ำ.",
      "Je ne sais pas pourquoi mais récemment depuis ce matin il n'y en a plus : tous les mots ont disparu.",
      "Ces mots s'occupent d'arroser mes plantations,",
      "alors je serais vraiment reconnaissante si vous pouviez réimplanter l'eau dans mon champs !",
      "Je sais qu'il y a un puits au sud d'ici ou on peut trouver des mots d'eau,",
      "pourriez-vous en ramener et l'implanter dans mon puits ?"
    ],
    "en_description": "Find the Spell น้ำ in the forest south of Chaiyaphum, and implant in in the well of the field of Chaiyaphum.",
    "fr_description": "Trouve le mot น้ำ dans la forêt au sud de Chaiyaphum, et implante-le dans le puits du champs de Chaiyaphum.",
    "en_end_description": "Go back to the farmer in Chaiyaphum's temple.",
    "fr_end_description": "Retourne voir la fermière au temple de Chaiyaphum.",
    "fr_finish_dialog": [
      "Merci mille fois ! Pour ta récompense, prends-ceci :",
      "[ShowNoName] Elle dépose un gecko tokay sur la tête de [Name]."
    ],
    "en_finish_dialog": [
      "Thank you so much! As a reward, take this:",
      "[ShowNoName] She puts a tokay gecko on the head of [Name]."
    ],
    "type": "implant_source_with_this_word",
    "parameters": [156, "EmptySourceField"]
  },
  "implant_any_source_with_dtat": {
    "blockers": ["implant_source_behind_the_temple"],
    "en_name": "Finding a home for ตัด",
    "fr_name": "Trouver un foyer pour ตัด",
    "counter_max": 1,
    "en_start_dialog": [
      "Hmm, [Name], I can say you have a way with words.",
      "I'll entrust you this useful one: ตัด.",
      "Find it a home, a source. Wherever you decide.",
      "Then, once this Spell has a home, you'll be able to harness its power forever.",
      "ตัด means \"to cut\", and if it follows you, it'll let you get rid of bushes that are in the way."
    ],
    "fr_start_dialog": [
      "C'est bien, [Name], je vois que tu débrouilles bien avec les Mots.",
      "Je vais te confier celui-là : ตัด.",
      "Trouve-lui un foyer, une source. Choisis la source que tu veux.",
      "Ensuite, une fois que ce Mot aura une source, tu pourras employer sa force pour toujours.",
      "ตัด signifie \"couper\", et s'il te suit, il te permettra de couper les buissons qui te bloquent la route.",
    ],
    "en_description": "Implant the Spell ตัด in any source.",
    "fr_description": "Implante le Mot ตัด dans la source que tu veux.",
    "en_end_description": "Go back to Anchalee in Chaiyaphum's temple.",
    "fr_end_description": "Retourne voir Anchalee au temple de Chaiyaphum.",
    "fr_finish_dialog": [
      "Très bien, je suis content que tu aies trouvé une Source pour ตัด !"
    ],
    "en_finish_dialog": [
      "Very good, I'm glad to hear you could find a Source for ตัด!"
    ],
    "type": "implant_any_source_with_this_word_i_gave_you",
    "parameters": [401]
  },
  "talk_to_anchalee_in_chaiyaphum": {
    "blockers": [],
    "en_name": "Going to Chaiyaphum",
    "fr_name": "Aller à Chaiyaphum",
    "counter_max": 1,
    "en_description": "Follow the path north from your house to get to Chaiyaphum, and find Anchalee, the grandmother of Ploy.",
    "fr_description": "Suis le chemin au nord de ta maison pour aller à Chaiyaphum, et parle à Anchalee, la grand-mère de Ploy.",
    "type": "talk_to_npc",
    "parameters": ["Anchalee"]
  },
  "talk_to_ajahn_jagaro_in_chaiyaphum": {
    "blockers": ["implant_any_source_with_dtat"],
    "en_name": "Going to Khon Kaen",
    "fr_name": "Aller à Khon Kaen",
    "en_start_dialog": [
      "Very good, now you will always be able to cut bushes in your way.",
      "If you want to continue with your training, you can go to Khon Kaen next.",
      "There's a monk over there that will be able to train you: Ajahn Jagaro.",
      "Find him, and he'll teach you great things! His specialty is teleportation through time and space.",
      "To go to Khon Kaen, go west from here, and use ตัด to cut the bush in your way."
    ],
    "fr_start_dialog": [
      "Très bien, maintenant tu pourras toujours couper ces buissons qui te bloquent !",
      "Si tu veux continuer avec ton éducation, tu devrais aller à Khon Kaen.",
      "Il y a un moine très doué là-bas qui pourra se charger de t'entraîner : Ajahn Jagaro.",
      "Trouve-le, et il t'enseignera des choses fantastiques ! Il sait se téléporter dans l'espace et le temps.",
      "Pour aller à Khon Kaen, dirige toi vers l'ouest, puis utilise ตัด pour couper les buissons qui te bloquent."
    ],
    "counter_max": 1,
    "en_description": "Follow the path west from Chaiyaphum, cut the bush in the way with ตัด, go to Khon Kaen and talk to Ajahn Jagaro in Khon Kaen's temple.",
    "fr_description": "Suis le chemin à l'ouest de Chaiyaphum, coupe le buisson sur le passage avec ตัด, va à Khon Kaen et parle à Ajahn Jagaro dans le temple de Khon Kaen.",
    "type": "talk_to_npc",
    "parameters": ["Ajahn Jagaro"]
  },
  "implant_word_cut": {
    "blockers": [],
    "en_name": "Repopulate ตัด",
    "en_description": "We get the Spell for cut: ตัด. We have to implant it into a source. When we have done so, the quest is complete. Until we do so, we can get the Spell again and again at the shaman.",
    "counter_max": 1,
    "type": "implant"
  },
  "go_back_home_and_talk_to_yaai": {
    "blockers": [],
    "en_name": "Back home",
    "en_description": "Talk to yaai at home.",
    "counter_max": 1,
    "type": "talk_to"
  },
  "purify_mohinkhao": {
    "blockers": [],
    "en_name": "Investigate Mo Hin Khao",
    "fr_name": "Investigation à Mo Hin Khao",
    "counter_max": 1,
    "en_start_dialog": [
      "Are you a shaman?",
      "I've heard reports that something is wrong in Mo Hin Khao, would you like to investigate?",
      "I've been told the Spells over there are aggressive even towards those who can't see Spirits unlike us,",
      "And that the land is tainted by an evil energy.",
      "To find Mo Hin Khao, follow take the path north next to the temple."
    ],
    "fr_start_dialog": [
      "Étudies-tu le chamanisme ? Alors tu veux peut-être te rendre utilie.",
      "On m'a dit qu'il y a des problèmes à Mo Hin Khao, voudrais-tu mener l'enquête ?",
      "Il paraît que les Mots là-bas sont devenus agressifs, même envers ceux qui ne voient pas les esprits comme nous.",
      "et que les environs sont teintés d'une énergie malfaisante.",
      "Pour trouver Mo Hin Khao, suis le chemin qui va au nord, près du temple."
    ],
    "en_description": "Investigate what is wrong in Mo Hin Khao. To get to Mo Hin Khao, follow the path going north by Chaiyaphum's temple",
    "fr_description": "Trouve ce qui ne va pas à Mo Hin Khao. Pour atteindre Mo Hin Khao, suis le chemin qui va vers le nord à coté du temple de Chaiyaphum.",
    "en_end_description": "Go back to the old monk in Chaiyaphum's temple.",
    "fr_end_description": "Retourne voir le vieux moine au temple de Chaiyaphum.",
    "fr_finish_dialog": [
      "On m'a dit que Mo Hin Khao a retrouvé sa paix ! Merci, [Name] !",
    ],
    "en_finish_dialog": [
      "I've been told Mo Hin Khao is back to its former peace! Thank you very much, [Name].",
    ],
    "type": "purifying",
    "parameters": ["MoHinKhao"]
  }
}
